# 데이터 재구조화

- 피벗 테이블
- melt
- stack, unstack
- 교차표

## #01. 준비과정

### [1] 패키지 참조

In [9]:
from pandas import DataFrame, read_excel
from pandas import pivot_table, crosstab, melt

In [10]:
origin = read_excel("https://data.hossam.kr/pydata/city_people.xlsx")
origin

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010  2632035  수도권

## #04. stack

모든 변수를 하나의 변수로 쌓아놓는 처리

### (1) 샘플 데이터 가져오기

In [ ]:
df = read_excel("https://data.hossam.kr/pydata/body.xlsx", index_col="name")
df

#### stack 처리

리턴 결과를 Series 객체가 된다.

In [ ]:
st = df.stack()
st

name
Lee   sex          M
      height     175
      weight    98.0
Park  sex          F
      height     167
      weight    48.0
Hong  sex          M
      height     180
Kim   sex          F
      height     162
      weight    55.0
Nam   sex          M
      height     172
      weight    85.0
dtype: object

#### stack 결과를 DataFrame으로 만들기

In [ ]:
df2 = DataFrame(st)
df2

                0
name
Lee  sex        M
     height   175
     weight  98.0
Park sex        F
     height   167
     weight  48.0
Hong sex        M
     height   180
Kim  sex        F
     height   162
     weight  55.0
Nam  sex        M
     height   172
     weight  85.0

#### 빈 값에 대한 처리

`dropna=False` 파라미터를 적용하면 빈값(`NaN`)을 유지한다. (기본값=True, 빈값 삭제)

In [ ]:
st2 = df.stack(dropna=False)
st2

name
Lee   sex          M
      height     175
      weight    98.0
Park  sex          F
      height     167
      weight    48.0
Hong  sex          M
      height     180
      weight     NaN
Kim   sex          F
      height     162
      weight    55.0
Nam   sex          M
      height     172
      weight    85.0
dtype: object

#### stack 결과를 원래대로 되돌림

In [ ]:
st.unstack()

     sex height weight
name
Lee    M    175   98.0
Park   F    167   48.0
Hong   M    180    NaN
Kim    F    162   55.0
Nam    M    172   85.0

#### unstack을 수행하면서 빈값을 다른 값으로 대체

In [ ]:
st.unstack(fill_value=100)

     sex height weight
name
Lee    M    175   98.0
Park   F    167   48.0
Hong   M    180    100
Kim    F    162   55.0
Nam    M    172   85.0

## #04. 교차표(crosstab)

범주형 자료를 갖는 데이터에 대해 각 범주별로 빈도수를 계산하여 표현한 표

### 1. 샘플 데이터 가져오기

In [ ]:
df = read_excel("https://data.hossam.kr/pydata/score.xlsx")
df

NameError: name 'read_excel' is not defined

### 2. 교차표 만들기

index 파라미터와 columns 파라미터를 지정한다.

In [ ]:
crosstab(index=df['gender'], columns=df['score'])

score   A  B  C
gender
M       1  2  1
W       1  1  2

### 3. 파라미터 설정

- rownames : 인덱스의 이름 설정
- colnames : 컬럼의 이름 설정
- margins : 집계 결과 포함 여부(True/False)

In [ ]:
crosstab(index=df['gender'], columns=df['score'],
         rownames=['성별'], colnames=['점수'], margins=True)

점수   A  B  C  All
성별
M    1  2  1    4
W    1  1  2    4
All  2  3  3    8

### 4. 비율 표시

- `normalize=True` 파라미터 사용

In [ ]:
crosstab(index=df['gender'], columns=df['score'],
         rownames=['성별'], colnames=['점수'], margins=True,
         normalize=True)

점수       A      B      C  All
성별
M    0.125  0.250  0.125  0.5
W    0.125  0.125  0.250  0.5
All  0.250  0.375  0.375  1.0